Table of Contents
 Class SectionCharacteristics
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Section characteristics
public class SectionCharacteristics
Inheritance
object
SectionCharacteristics
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 A
Gets or sets the area.
public double A { get; set; }
Property Value
double
 Ay
Shear area
public double Ay { get; set; }
Property Value
double
 Az
Shear area
public double Az { get; set; }
Property Value
double
 Cgy
Gets the centre of gravity related to the axis Y.
public double Cgy { get; set; }
Property Value
double
 Cgz
Gets the centre of gravity related to the axis Z.
public double Cgz { get; set; }
Property Value
double
 Dyz
Gets or sets the product moment of area.
public double Dyz { get; set; }
Property Value
double
 E
Gets or sets the responding E modulus.
public double E { get; set; }
Property Value
double
 It
Gets or sets the Torsional constant.
public double It { get; set; }
Property Value
double
 Iw
Gets or sets the Warping constant.
public double Iw { get; set; }
Property Value
double
 Iy
Gets or sets the second moment of area related to the Y axis.
public double Iy { get; set; }
Property Value
double
 Iz
Gets or sets the second moment of area related to the Z axis.
public double Iz { get; set; }
Property Value
double
 Rgy
Gets the radius of gyration related to the axis Y. Also known as iy.
public double Rgy { get; set; }
Property Value
double
 Rgz
Gets the radius of gyration related to the axis Z. Also known as iz.
public double Rgz { get; set; }
Property Value
double
 Sy
Gets or sets the first moment of area related to the Y axis.
public double Sy { get; set; }
Property Value
double
 Sz
Gets or sets the first moment of area related to the Z axis.
public double Sz { get; set; }
Property Value
double
 Wely
Gets or sets the Elastic section modulus related to axis Y.
public double Wely { get; set; }
Property Value
double
 Welz
Gets or sets the Elastic section modulus related to axis Z.
public double Welz { get; set; }
Property Value
double
 Wply
Gets or sets the Plastic section modulus related to axis Y.
public double Wply { get; set; }
Property Value
double
 Wplz
Gets or sets the Plastic section modulus related to axis Z.
public double Wplz { get; set; }
Property Value
double
 Y0
Gets or sets the Shear center coordinate Y related to the center of gravity.
public double Y0 { get; set; }
Property Value
double
 Z0
Gets or sets the Shear center coordinate Z related to the center of gravity.
public double Z0 { get; set; }
Property Value
double
 Edit this page